In [1]:
import pandas as pd

In [2]:
# 1. Create a Pandas Series using a list of 5 random numbers and custom index names.
#     Then print the series and its data type.

list1=[10,20,30,40,50]
df=pd.Series(list1,index=['A','B','C','D','E'])
df

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [9]:
# 1. Create a Pandas Series using a list of 5 random numbers and custom index names.
#     Then print the series and its data type.
dict1={
    "student_name" :['Yash','Prajwal','Harshal'],
    "Maths" :[90,98,97],
    "Science":[89,78,67],
    "English":[78,98,56]

}
df_marks=pd.DataFrame(dict1)
df_marks.head(3)

  student_name  Maths  Science  English
0         Yash     90       89       78
1      Prajwal     98       78       98
2      Harshal     97       67       56

In [8]:
# 3. Import a CSV file (use any sample dataset) into a DataFrame.
#  Display the number of rows and columns using shape, and print column names.

df=pd.read_csv(r"C:\Users\Lenovo\OneDrive\Desktop\practice\lecture\pandas\saved_csv.csv")
print("the shape of df is :",df.shape)
print("the columns are:",df.columns)

the shape of df is : (3, 7)
the columns are: Index(['name', 'age', 'salary', 'bonus', 'salary_rank', 'joining date',
       'joining year'],
      dtype='object')

In [13]:
# 4. Add a new column named "Total_Marks" that sums all three subject scores.
#     Then create another column "Average" by dividing Total_Marks by 3.
df_marks['Total_marks']=df_marks['Maths']+df_marks['English']+df_marks['Science']
df_marks['AVG']=df_marks['Total_marks']/3
df_marks

  student_name  Maths  Science  English  Total_marks        AVG
0         Yash     90       89       78          257  85.666667
1      Prajwal     98       78       98          274  91.333333
2      Harshal     97       67       56          220  73.333333

In [19]:
# 5. Introduce a missing value (NaN) in the "Science" column and then:
#     (a) Identify missing values using isnull()
#     (b) Replace the missing value with the column mean using fillna().
df_marks.loc[2,'Science']=None
print("the NA vlues is:",df_marks.isnull())
df_marks['Science']=df_marks['Science'].fillna(df_marks['Science'].mean())
print("After filling NA values the df is :\n",df_marks)

the NA vlues is:    student_name  Maths  Science  English  Total_marks    AVG
0         False  False    False    False        False  False
1         False  False    False    False        False  False
2         False  False     True    False        False  False
After filling NA values the df is :
   student_name  Maths  Science  English  Total_marks        AVG
0         Yash     90     89.0       78          257  85.666667
1      Prajwal     98     78.0       98          274  91.333333
2      Harshal     97     83.5       56          220  73.333333

In [20]:
# 6. Filter and display all students whose "Average" score is greater than 75.
df_marks[df_marks['AVG']>75]

  student_name  Maths  Science  English  Total_marks        AVG
0         Yash     90     89.0       78          257  85.666667
1      Prajwal     98     78.0       98          274  91.333333

In [24]:

# 7. Sort the DataFrame by "Total_Marks" in descending order and show the top 3 performers.
print(df_marks.sort_values(by='Total_marks',ascending=False).head(2))

  student_name  Maths  Science  English  Total_marks        AVG
1      Prajwal     98     78.0       98          274  91.333333
0         Yash     90     89.0       78          257  85.666667

In [ ]:
# 8. Group students based on their "English" score range (like above or below 70)
#     and find the mean of "Maths" and "Science" marks for each group.

group_data=df_marks.groupby(df_marks['English']>70).agg({'Maths':'mean','Science':'mean'})

group_data

         Maths  Science
English
False     97.0     83.5
True      94.0     83.5

In [38]:
# 9. Merge two DataFrames:
#     (a) One with "Student_Name" and "Total_Marks"
#     (b) Another with "Student_Name" and "Sports_Score"
#     Then create a new column "Overall_Score" = Total_Marks + Sports_Score

df2={
    "student_name":["Yash","Prajwal","Harshal"],
    "Sports_score":[90,89,90]
}
df2=pd.DataFrame(df2)
merged_df=pd.merge(df_marks,df2,on='student_name')
print(merged_df)
merged_df['Overall_Score']=merged_df['Total_marks']+merged_df['Sports_score']
print(merged_df)

  student_name  Maths  Science  English  Total_marks        AVG  Sports_score
0         Yash     90     89.0       78          257  85.666667            90
1      Prajwal     98     78.0       98          274  91.333333            89
2      Harshal     97     83.5       56          220  73.333333            90
  student_name  Maths  Science  English  Total_marks        AVG  Sports_score  \
0         Yash     90     89.0       78          257  85.666667            90
1      Prajwal     98     78.0       98          274  91.333333            89
2      Harshal     97     83.5       56          220  73.333333            90

   Overall_Score
0            347
1            363
2            310

In [40]:
# 10. Export the final DataFrame to a CSV file on your Desktop (use os library to define path)
#     and verify if the file is successfully created using os.path.exists().
import os
df_marks.to_csv("Marks.csv",index=False)
path=os.getcwd()
print("the path is :",os.getcwd())
print("Is the path exist:",os.path.exists(path))

the path is : c:\Users\Lenovo\OneDrive\Desktop\practice\Assignments\ML
Is the path exist: True